src/InformationRegisters/ГраницыПартий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ГраницыПартий</Name>
			<Comment>Границы последовательности партий</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МоментВремени</Name>
					<Comment>Момент времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСсылка</Name>
					<Comment>Документ ссылка</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.Разделка</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДвижений</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.Комплектация</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ТаможеннаяДекларацияИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводВЭксплуатацию</v8:Type>
						<v8:Type>cfg:DocumentRef.ОбслуживаниеАктива</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
						<v8:Type>cfg:DocumentRef.Переоценка</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.Разукомплектация</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ГраницыВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ГраницыВзаиморасчетов</Name>
			<Comment>Границы последовательности взаиморасчетов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МоментВремени</Name>
					<Comment>Момент времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСсылка</Name>
					<Comment>Документ ссылка</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПриемаПередачиЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыплатаЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.Взаимозачет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДвижений</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.ТаможеннаяДекларацияИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковВзаиморасчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
						<v8:Type>cfg:DocumentRef.Чек</v8:Type>
						<v8:Type>cfg:DocumentRef.ОбслуживаниеАктива</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.Инкассация</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаВалютныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ГраницыЗаказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ГраницыЗаказы</Name>
			<Comment>Границы последовательности заказов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МоментВремени</Name>
					<Comment>Момент времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСсылка</Name>
					<Comment>Документ ссылка</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаменаВЗаказеПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаменаВЗаказеПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДвижений</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаказаПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеРезервов</v8:Type>
						<v8:Type>cfg:DocumentRef.СнятиеРаспределенияЗаказовПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаказаПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РезервированиеЗаказовПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспределениеЗаказаПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СнятиеРезервовЗаказовПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Comment>Заказ покупателя, внутренний, поставщику</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ГраницыОрдерныйСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ГраницыОрдерныйСклад</Name>
			<Comment>Границы последовательности ордерный склад</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МоментВремени</Name>
					<Comment>Момент времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСсылка</Name>
					<Comment>Документ ссылка</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДвижений</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияОрдерногоСклада</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереразмещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйСкладскойОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйСкладскойОрдер</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/РаботаСГраницами/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль по работе с границами последовательностей:
//  регистрация,
//  удаление,
//  восстановление;
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ПередУдалением(Объект, Отказ) Экспорт
	
	Если НЕ Объект.Проведен Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ДвигаетРегистр(Объект, "ПартииТоваровКомпании") Тогда
		
		РегистрыСведений.ГраницыПартий.УдалитьСсылкуНаДокумент(Объект.Ссылка);
		
	КонецЕсли;
	
	Если ДвигаетРегистр(Объект, "ВзаиморасчетыКомпании") Тогда
		
		РегистрыСведений.ГраницыВзаиморасчетов.УдалитьСсылкуНаДокумент(Объект.Ссылка);
		
	КонецЕсли;
	
	Если ДвигаетРегистр(Объект, "ЗаказыПокупателей")
		ИЛИ ДвигаетРегистр(Объект, "ЗаказыПоставщикам")
		ИЛИ ДвигаетРегистр(Объект, "ЗаказыРаспределение") Тогда
		
		РегистрыСведений.ГраницыЗаказы.УдалитьСсылкуНаДокумент(Объект.Ссылка);
		
	КонецЕсли;
	
	Если ДвигаетРегистр(Объект, "ОстаткиТоваровОрдерныйСклад") Тогда
		
		РегистрыСведений.ГраницыОрдерныйСклад.УдалитьСсылкуНаДокумент(Объект.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Объект, Отказ) Экспорт
	
	Если Объект.ДополнительныеСвойства.Свойство("ДвиженияВзаиморасчетовПередПроведением") Тогда
		
		РаботаСГраницами.СдвинутьГраницуВзаиморасчетов(Объект.Ссылка, Объект.ДополнительныеСвойства, Объект.Движения);
		РегистрыСведений.ГраницыВзаиморасчетов.УдалитьСсылкуНаДокумент(Объект.Ссылка);
		
	КонецЕсли;
	
	Если Объект.ДополнительныеСвойства.Свойство("ДвиженияПоЗаказамПередПроведением") Тогда
		
		РаботаСГраницами.СдвинутьГраницуЗаказов(Объект.Ссылка, Объект.ДополнительныеСвойства, Объект.Движения);
		РегистрыСведений.ГраницыЗаказы.УдалитьСсылкуНаДокумент(Объект.Ссылка);
		
	КонецЕсли;
	
	Если Объект.ДополнительныеСвойства.Свойство("ДвиженияПартийПередПроведением") Тогда
		
		РаботаСГраницами.СдвинутьГраницуПартий(Объект.Ссылка, Объект.ДополнительныеСвойства, Объект.Движения);
		РегистрыСведений.ГраницыПартий.УдалитьСсылкуНаДокумент(Объект.Ссылка);
		
	КонецЕсли;
	
	Если Объект.ДополнительныеСвойства.Свойство("ДвиженияОрдерныйУчетПередПроведением") Тогда
		
		РаботаСГраницами.СдвинутьГраницуОрдерногоУчета(Объект.Ссылка, Объект.ДополнительныеСвойства, Объект.Движения);
		РегистрыСведений.ГраницыОрдерныйСклад.УдалитьСсылкуНаДокумент(Объект.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура МоментВремениПередПроведением(Документ, ДополнительныеСвойства) Экспорт
	
	Если Документ.Пустая() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "МоментВремени,Проведен");
	
	Если РеквизитыДокумента.Проведен Тогда
		
		ДополнительныеСвойства.Вставить("МоментВремениБыл", РеквизитыДокумента.МоментВремени);
		
	КонецЕсли;
	
КонецПроцедуры

#Область Взаиморасчеты

Процедура ДвиженияПоВзаиморасчетамПередПроведением(Документ, ДополнительныеСвойства) Экспорт
	
	Если ЭтоОперативноеПроведение(ДополнительныеСвойства)
		ИЛИ ДополнительныеСвойства.Свойство("ДвиженияВзаиморасчетовПередПроведением") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ДвиженияВзаиморасчетовПередПроведением",
		ДвиженияПоРегистру(Документ, Метаданные.РегистрыНакопления.ВзаиморасчетыКомпании));
	
КонецПроцедуры

Процедура СдвинутьГраницуВзаиморасчетов(Документ, ДополнительныеСвойства, ТекущиеДвижения) Экспорт
	
	Если ЭтоОперативноеПроведение(ДополнительныеСвойства) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	МоментВремениБыл = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "МоментВремениБыл");
	ДвиженияДо = ПолучитьЗначениеПараметраСтруктуры(ДополнительныеСвойства, "ДвиженияВзаиморасчетовПередПроведением");
	ДвиженияСейчас = ТекущиеДвижения.ВзаиморасчетыКомпании.Выгрузить();
	
	Если НЕ (МоментВремениБыл <> Документ.МоментВремени() ИЛИ ДвиженияИзменились(ДвиженияДо, ДвиженияСейчас)) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МоментФиксации = МоментФиксации(Документ, МоментВремениБыл);
	ОтборПоАналитикам = "И ТаблицаДвижений.ДоговорВзаиморасчетов В (&Договора)";
	Договора = ДвиженияДо.ВыгрузитьКолонку("ДоговорВзаиморасчетов");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Договора, ДвиженияСейчас.ВыгрузитьКолонку("ДоговорВзаиморасчетов"), Истина);
	ЗначенияАналитик = Новый Структура("Договора", Договора);
	
	Если НЕ ЕстьДокументыПосле(Документ, МоментФиксации, "ВзаиморасчетыКомпании", ОтборПоАналитикам, ЗначенияАналитик) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ГраницыВзаиморасчетов.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	ГраницыВзаиморасчетов.МоментВремени КАК МоментВремени,
	|	ГраницыВзаиморасчетов.ДокументСсылка КАК ДокументСсылка
	|ИЗ
	|	РегистрСведений.ГраницыВзаиморасчетов КАК ГраницыВзаиморасчетов
	|ГДЕ
	|	ГраницыВзаиморасчетов.ДоговорВзаиморасчетов В(&Договора)");
	Запрос.УстановитьПараметр("Договора", Договора);
	ТекущиеГраницы = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Договор Из Договора Цикл
		
		СтрокиПоУсловию = ТекущиеГраницы.НайтиСтроки(Новый Структура("ДоговорВзаиморасчетов", Договор));
		ОбновитьГраницу = Истина;
		
		Если СтрокиПоУсловию.Количество() Тогда
			
			МоментВремениКПроверке = Новый МоментВремени(СтрокиПоУсловию[0].МоментВремени, СтрокиПоУсловию[0].ДокументСсылка);
			ОбновитьГраницу = (МоментФиксации.Сравнить(МоментВремениКПроверке) = -1);
			
		КонецЕсли;
		
		Если ОбновитьГраницу Тогда
			
			НоваяЗапись = РегистрыСведений.ГраницыВзаиморасчетов.СоздатьМенеджерЗаписи();
			НоваяЗапись.ДоговорВзаиморасчетов = Договор;
			НоваяЗапись.МоментВремени         = МоментФиксации.Дата;
			НоваяЗапись.ДокументСсылка        = МоментФиксации.Ссылка;
			НоваяЗапись.Записать(Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Заказы

Процедура ДвиженияПоЗаказамПередПроведением(Документ, ДополнительныеСвойства) Экспорт
	
	Если ЭтоОперативноеПроведение(ДополнительныеСвойства)
		ИЛИ ДополнительныеСвойства.Свойство("ДвиженияПоЗаказамПередПроведением") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Регистры = Новый Структура();
	Регистры.Вставить("ЗаказыПокупателей", Метаданные.РегистрыНакопления.ЗаказыПокупателей);
	Регистры.Вставить("ЗаказыПоставщикам", Метаданные.РегистрыНакопления.ЗаказыПоставщикам);
	Регистры.Вставить("ЗаказыРаспределение", Метаданные.РегистрыНакопления.ЗаказыРаспределение);
	ОписаниеДвижений = Документ.Метаданные().Движения;
	Результат = Новый Структура();
	
	Для Каждого Регистр Из Регистры Цикл
		
		Если НЕ ОписаниеДвижений.Содержит(Регистр.Значение) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Результат.Вставить(Регистр.Ключ, ДвиженияПоРегистру(Документ, Регистр.Значение));
		
	КонецЦикла;
	
	ДополнительныеСвойства.Вставить("ДвиженияПоЗаказамПередПроведением", Результат);
	
КонецПроцедуры

Процедура СдвинутьГраницуЗаказов(Документ, ДополнительныеСвойства, ТекущиеДвижения) Экспорт
	
	Если ЭтоОперативноеПроведение(ДополнительныеСвойства) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	МоментВремениБыл = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "МоментВремениБыл");
	ДвиженияДо = ПолучитьЗначениеПараметраСтруктуры(ДополнительныеСвойства, "ДвиженияПоЗаказамПередПроведением");
	ДвиженияСейчас = Новый Структура();
	
	Если ДвиженияДо.Свойство("ЗаказыПокупателей") Тогда
		
		ДвиженияСейчас.Вставить("ЗаказыПокупателей", ТекущиеДвижения.ЗаказыПокупателей.Выгрузить());
		
	КонецЕсли;
	
	Если ДвиженияДо.Свойство("ЗаказыПоставщикам") Тогда
		
		ДвиженияСейчас.Вставить("ЗаказыПоставщикам", ТекущиеДвижения.ЗаказыПоставщикам.Выгрузить());
		
	КонецЕсли;
	
	Если ДвиженияДо.Свойство("ЗаказыРаспределение") Тогда
		
		ДвиженияСейчас.Вставить("ЗаказыРаспределение", ТекущиеДвижения.ЗаказыРаспределение.Выгрузить());
		
	КонецЕсли;
	
	Если НЕ (
		МоментВремениБыл <> Документ.МоментВремени()
		ИЛИ (ДвиженияДо.Свойство("ЗаказыПокупателей") И ДвиженияИзменились(ДвиженияДо.ЗаказыПокупателей, ДвиженияСейчас.ЗаказыПокупателей))
		ИЛИ (ДвиженияДо.Свойство("ЗаказыПоставщикам") И ДвиженияИзменились(ДвиженияДо.ЗаказыПоставщикам, ДвиженияСейчас.ЗаказыПоставщикам))
		ИЛИ (ДвиженияДо.Свойство("ЗаказыРаспределение") И ДвиженияИзменились(ДвиженияДо.ЗаказыРаспределение, ДвиженияСейчас.ЗаказыРаспределение))
	) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МоментФиксации = МоментФиксации(Документ, МоментВремениБыл);
	ОтборПоАналитикамЗаказыПокупателей = "И ТаблицаДвижений.Заказ В (&ЗаказыПокупателей)";
	ОтборПоАналитикамЗаказыПоставщикам = "И ТаблицаДвижений.ЗаказПоставщику В (&ЗаказыПоставщикам)";
	ОтборПоАналитикамЗаказыРаспределение = "И ТаблицаДвижений.ЗаказПокупателя В (&ЗаказыПокупателей)
	|И ТаблицаДвижений.ЗаказПоставщика В (&ЗаказыПоставщикам)";
	ЗаказыПокупателей = Новый Массив;
	ЗаказыПоставщикам = Новый Массив;
	
	Если ДвиженияДо.Свойство("ЗаказыПокупателей") Тогда
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ЗаказыПокупателей, ДвиженияДо.ЗаказыПокупателей.ВыгрузитьКолонку("Заказ"));
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ЗаказыПокупателей, ДвиженияСейчас.ЗаказыПокупателей.ВыгрузитьКолонку("Заказ"), Истина);
		
	КонецЕсли;
	
	Если ДвиженияДо.Свойство("ЗаказыПоставщикам") Тогда
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ЗаказыПоставщикам, ДвиженияДо.ЗаказыПоставщикам.ВыгрузитьКолонку("ЗаказПоставщику"));
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ЗаказыПоставщикам, ДвиженияСейчас.ЗаказыПоставщикам.ВыгрузитьКолонку("ЗаказПоставщику"), Истина);
		
	КонецЕсли;
	
	Если ДвиженияДо.Свойство("ЗаказыРаспределение") Тогда
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
			ЗаказыПокупателей, ДвиженияДо.ЗаказыРаспределение.ВыгрузитьКолонку("ЗаказПокупателя"), Истина);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
			ЗаказыПокупателей, ДвиженияСейчас.ЗаказыРаспределение.ВыгрузитьКолонку("ЗаказПокупателя"), Истина);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
			ЗаказыПоставщикам, ДвиженияДо.ЗаказыРаспределение.ВыгрузитьКолонку("ЗаказПоставщика"), Истина);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
			ЗаказыПоставщикам, ДвиженияСейчас.ЗаказыРаспределение.ВыгрузитьКолонку("ЗаказПоставщика"), Истина);
		
	КонецЕсли;
	
	ЗначенияАналитик = Новый Структура("ЗаказыПокупателей,ЗаказыПоставщикам", ЗаказыПокупателей, ЗаказыПоставщикам);
	
	Если НЕ (
		(ДвиженияДо.Свойство("ЗаказыПокупателей")
			И ЕстьДокументыПосле(Документ, МоментФиксации, "ЗаказыПокупателей", ОтборПоАналитикамЗаказыПокупателей, ЗначенияАналитик))
		ИЛИ (ДвиженияДо.Свойство("ЗаказыПоставщикам")
			И ЕстьДокументыПосле(Документ, МоментФиксации, "ЗаказыПоставщикам", ОтборПоАналитикамЗаказыПоставщикам, ЗначенияАналитик))
		ИЛИ (ДвиженияДо.Свойство("ЗаказыРаспределение")
			И ЕстьДокументыПосле(Документ, МоментФиксации, "ЗаказыРаспределение", ОтборПоАналитикамЗаказыРаспределение, ЗначенияАналитик))
	) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Заказы = ЗаказыПокупателей;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Заказы, ЗаказыПоставщикам);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ГраницыЗаказы.Заказ КАК Заказ,
	|	ГраницыЗаказы.МоментВремени КАК МоментВремени,
	|	ГраницыЗаказы.ДокументСсылка КАК ДокументСсылка
	|ИЗ
	|	РегистрСведений.ГраницыЗаказы КАК ГраницыЗаказы
	|ГДЕ
	|	ГраницыЗаказы.Заказ В(&Заказы)");
	Запрос.УстановитьПараметр("Заказы", Заказы);
	ТекущиеГраницы = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Заказ Из Заказы Цикл
		
		СтрокиПоУсловию = ТекущиеГраницы.НайтиСтроки(Новый Структура("Заказ", Заказ));
		ОбновитьГраницу = Истина;
		
		Если СтрокиПоУсловию.Количество() Тогда
			
			МоментВремениКПроверке = Новый МоментВремени(СтрокиПоУсловию[0].МоментВремени, СтрокиПоУсловию[0].ДокументСсылка);
			ОбновитьГраницу = (МоментФиксации.Сравнить(МоментВремениКПроверке) = -1);
			
		КонецЕсли;
		
		Если ОбновитьГраницу Тогда
			
			НоваяЗапись = РегистрыСведений.ГраницыЗаказы.СоздатьМенеджерЗаписи();
			НоваяЗапись.Заказ = Заказ;
			НоваяЗапись.МоментВремени = МоментФиксации.Дата;
			НоваяЗапись.ДокументСсылка = МоментФиксации.Ссылка;
			НоваяЗапись.Записать(Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Партии

Процедура ДвиженияПоПартиямПередПроведением(Документ, ДополнительныеСвойства) Экспорт
	
	Если ЭтоОперативноеПроведение(ДополнительныеСвойства)
		ИЛИ ДополнительныеСвойства.Свойство("ДвиженияПартийПередПроведением") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ДвиженияПартийПередПроведением",
		ДвиженияПоРегистру(Документ, Метаданные.РегистрыНакопления.ПартииТоваровКомпании));
	
КонецПроцедуры

Процедура СдвинутьГраницуПартий(Документ, ДополнительныеСвойства, ТекущиеДвижения) Экспорт
	
	Если ЭтоОперативноеПроведение(ДополнительныеСвойства) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	МоментВремениБыл = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "МоментВремениБыл");
	ДвиженияДо = ПолучитьЗначениеПараметраСтруктуры(ДополнительныеСвойства, "ДвиженияПартийПередПроведением");
	ДвиженияСейчас = ТекущиеДвижения.ПартииТоваровКомпании.Выгрузить();
	
	Если НЕ (МоментВремениБыл <> Документ.МоментВремени() ИЛИ ДвиженияИзменились(ДвиженияДо, ДвиженияСейчас)) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МоментФиксации = МоментФиксации(Документ, МоментВремениБыл);
	ОтборПоАналитикам = "И ТаблицаДвижений.СкладКомпании В (&Склады)";
	Склады = ДвиженияДо.ВыгрузитьКолонку("СкладКомпании");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Склады, ДвиженияСейчас.ВыгрузитьКолонку("СкладКомпании"), Истина);
	ЗначенияАналитик = Новый Структура("Склады", Склады);
	
	Если НЕ ЕстьДокументыПосле(Документ, МоментФиксации, "ПартииТоваровКомпании", ОтборПоАналитикам, ЗначенияАналитик) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ГраницыПартий.СкладКомпании КАК СкладКомпании,
	|	ГраницыПартий.МоментВремени КАК МоментВремени,
	|	ГраницыПартий.ДокументСсылка КАК ДокументСсылка
	|ИЗ
	|	РегистрСведений.ГраницыПартий КАК ГраницыПартий
	|ГДЕ
	|	ГраницыПартий.СкладКомпании В(&Склады)");
	Запрос.УстановитьПараметр("Склады", Склады);
	ТекущиеГраницы = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Склад Из Склады Цикл
		
		СтрокиПоУсловию = ТекущиеГраницы.НайтиСтроки(Новый Структура("СкладКомпании", Склад));
		ОбновитьГраницу = Истина;
		
		Если СтрокиПоУсловию.Количество() Тогда
			
			МоментВремениКПроверке = Новый МоментВремени(СтрокиПоУсловию[0].МоментВремени, СтрокиПоУсловию[0].ДокументСсылка);
			ОбновитьГраницу = (МоментФиксации.Сравнить(МоментВремениКПроверке) = -1);
			
		КонецЕсли;
		
		Если ОбновитьГраницу Тогда
			
			НоваяЗапись = РегистрыСведений.ГраницыПартий.СоздатьМенеджерЗаписи();
			НоваяЗапись.СкладКомпании = Склад;
			НоваяЗапись.МоментВремени = МоментФиксации.Дата;
			НоваяЗапись.ДокументСсылка = МоментФиксации.Ссылка;
			НоваяЗапись.Записать(Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОрдерныйУчет

Процедура ДвиженияПоОрдерномуУчетуПередПроведением(Документ, ДополнительныеСвойства) Экспорт
	
	Если ЭтоОперативноеПроведение(ДополнительныеСвойства)
		ИЛИ ДополнительныеСвойства.Свойство("ДвиженияОрдерныйУчетПередПроведением") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ДвиженияОрдерныйУчетПередПроведением",
		ДвиженияПоРегистру(Документ, Метаданные.РегистрыНакопления.ОстаткиТоваровОрдерныйСклад));
	
КонецПроцедуры

Процедура СдвинутьГраницуОрдерногоУчета(Документ, ДополнительныеСвойства, ТекущиеДвижения) Экспорт
	
	Если ЭтоОперативноеПроведение(ДополнительныеСвойства) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	МоментВремениБыл = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "МоментВремениБыл");
	ДвиженияДо = ПолучитьЗначениеПараметраСтруктуры(ДополнительныеСвойства, "ДвиженияОрдерныйУчетПередПроведением");
	ДвиженияСейчас = ТекущиеДвижения.ОстаткиТоваровОрдерныйСклад.Выгрузить();
	
	Если НЕ (МоментВремениБыл <> Документ.МоментВремени() ИЛИ ДвиженияИзменились(ДвиженияДо, ДвиженияСейчас)) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МоментФиксации = МоментФиксации(Документ, МоментВремениБыл);
	ОтборПоАналитикам = "И ТаблицаДвижений.СкладКомпании В (&Склады)";
	Склады = ДвиженияДо.ВыгрузитьКолонку("СкладКомпании");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Склады, ДвиженияСейчас.ВыгрузитьКолонку("СкладКомпании"), Истина);
	ЗначенияАналитик = Новый Структура("Склады", Склады);
	
	Если НЕ ЕстьДокументыПосле(Документ, МоментФиксации, "ОстаткиТоваровОрдерныйСклад", ОтборПоАналитикам, ЗначенияАналитик) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ГраницыОрдерныйСклад.СкладКомпании КАК СкладКомпании,
	|	ГраницыОрдерныйСклад.МоментВремени КАК МоментВремени,
	|	ГраницыОрдерныйСклад.ДокументСсылка КАК ДокументСсылка
	|ИЗ
	|	РегистрСведений.ГраницыОрдерныйСклад КАК ГраницыОрдерныйСклад
	|ГДЕ
	|	ГраницыОрдерныйСклад.СкладКомпании В(&Склады)");
	Запрос.УстановитьПараметр("Склады", Склады);
	ТекущиеГраницы = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Склад Из Склады Цикл
		
		СтрокиПоУсловию = ТекущиеГраницы.НайтиСтроки(Новый Структура("СкладКомпании", Склад));
		ОбновитьГраницу = Истина;
		
		Если СтрокиПоУсловию.Количество() Тогда
			
			МоментВремениКПроверке = Новый МоментВремени(СтрокиПоУсловию[0].МоментВремени, СтрокиПоУсловию[0].ДокументСсылка);
			ОбновитьГраницу = (МоментФиксации.Сравнить(МоментВремениКПроверке) = -1);
			
		КонецЕсли;
		
		Если ОбновитьГраницу Тогда
			
			НоваяЗапись = РегистрыСведений.ГраницыОрдерныйСклад.СоздатьМенеджерЗаписи();
			НоваяЗапись.СкладКомпании = Склад;
			НоваяЗапись.МоментВремени = МоментФиксации.Дата;
			НоваяЗапись.ДокументСсылка = МоментФиксации.Ссылка;
			НоваяЗапись.Записать(Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭтоОперативноеПроведение(ДополнительныеСвойства)
	
	РежимПроведения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "РежимПроведения");
	ЭтоНовый = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ЭтоНовый", Ложь);
	Возврат (РежимПроведения = РежимПроведенияДокумента.Оперативный) И ЭтоНовый;
	
КонецФункции

Функция ДвигаетРегистр(Объект, Регистр)
	
	Возврат Объект.Движения.Найти(Регистр) <> Неопределено;
	
КонецФункции

Функция ДвиженияПоРегистру(Документ, Регистр)
	
	ШаблонЗапроса = "ВЫБРАТЬ
	|	Регистр.Период КАК Период,
	|	Регистр.ВидДвижения КАК ВидДвижения,
	|	%2
	|ИЗ
	|	%1 КАК Регистр
	|ГДЕ
	|	Регистр.Регистратор = &Регистратор";
	ШаблонПоля = "Регистр.%1 КАК %1";
	ПоляЗапроса = Новый Массив;
	
	Для Каждого Измерение Из Регистр.Измерения Цикл
		
		ПоляЗапроса.Добавить(СтрШаблон(ШаблонПоля, Измерение.Имя));
		
	КонецЦикла;
	
	Для Каждого Измерение Из Регистр.Ресурсы Цикл
		
		ПоляЗапроса.Добавить(СтрШаблон(ШаблонПоля, Измерение.Имя));
		
	КонецЦикла;
	
	ТекстЗапроса = СтрШаблон(ШаблонЗапроса, Регистр.ПолноеИмя(), СтрСоединить(ПоляЗапроса, "," + Символы.ПС));
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Регистратор", Документ);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция МоментФиксации(Документ, МоментВремениБыл)
	
	МоментФиксации = Документ.МоментВремени();
	
	Если ЗначениеЗаполнено(МоментВремениБыл) И МоментВремениБыл.Сравнить(МоментФиксации) = -1 Тогда
		
		МоментФиксации = МоментВремениБыл;
		
	КонецЕсли;
	
	Возврат МоментФиксации;
	
КонецФункции

Функция ДвиженияИзменились(ДвиженияДо, ДвиженияСейчас)
	
	Если ТипЗнч(ДвиженияДо) <> Тип("ТаблицаЗначений") ИЛИ ДвиженияДо.Количество() <> ДвиженияСейчас.Количество() Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	ПоляПоиска = Новый Массив;
	
	Для Каждого Колонка Из ДвиженияДо.Колонки Цикл
		
		ПоляПоиска.Добавить(Колонка.Имя);
		
	КонецЦикла;
	
	УсловиеПоиска = Новый Структура(СтрСоединить(ПоляПоиска, ","));
	
	Для Каждого Строка Из ДвиженияДо Цикл
		
		ЗаполнитьЗначенияСвойств(УсловиеПоиска, Строка);
		
		Если НЕ ДвиженияСейчас.НайтиСтроки(УсловиеПоиска).Количество() Тогда
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ЕстьДокументыПосле(Документ, МоментВремени, ИмяТаблицыДвижений, ОтборПоАналитикам="", ЗначенияАналитик=Неопределено)
	
	Запрос = Новый Запрос(СтрШаблон(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТаблицаДвижений.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.%1 КАК ТаблицаДвижений
	|ГДЕ
	|	ТаблицаДвижений.Регистратор <> &Документ
	|	И ТаблицаДвижений.МоментВремени > &МоментФиксации
	|	%2", ИмяТаблицыДвижений, ОтборПоАналитикам));
	Запрос.УстановитьПараметр("МоментФиксации", МоментВремени);
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Если ЗначенияАналитик <> Неопределено Тогда
		
		ТипАналитик = ТипЗнч(ЗначенияАналитик);
		
		Если ТипАналитик = Тип("Структура") Тогда
		
			Для Каждого КлючЗначение Из ЗначенияАналитик Цикл
				
				Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
				
			КонецЦикла;
			
		ИначеЕсли ТипАналитик = Тип("МенеджерВременныхТаблиц") Тогда
			
			Запрос.МенеджерВременныхТаблиц = ЗначенияАналитик;
			
		Иначе
			
			ВызватьИсключение НСтр("ru = 'Не поддерживаемый тип аналитик. Ожидается Структура или МенеджерВременныхТаблиц'");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти
